In [31]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.preprocessing import OneHotEncoder

In [32]:
titanic_dataset = pd.read_csv("Dataset/test.csv")

In [33]:
titanic_dataset

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [34]:
lis = np.array(["Passenger ID","Passenger Ticket Class","Name","Gender","Age","No of siblings/spouses aboard","No of parents/children aboard","Ticket number","Passenger fare","Cabin number","Port of Embarkation"])

In [35]:
titanic_dataset.columns = lis

In [36]:
titanic_dataset

,Passenger ID,Passenger Ticket Class,Name,Gender,Age,No of siblings/spouses aboard,No of parents/children aboard,Ticket number,Passenger fare,Cabin number,Port of Embarkation
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [37]:
titanic_dataset.count()

Passenger ID                     418
Passenger Ticket Class           418
Name                             418
Gender                           418
Age                              332
No of siblings/spouses aboard    418
No of parents/children aboard    418
Ticket number                    418
Passenger fare                   417
Cabin number                      91
Port of Embarkation              418
dtype: int64

In [38]:
titanic_dataset["Cabin number"].count()*100/titanic_dataset["Name"].count()

21.770334928229666

In [39]:
titanic_df1 = titanic_dataset.drop("Cabin number",axis=1,inplace=False)

In [40]:
titanic_df1

,Passenger ID,Passenger Ticket Class,Name,Gender,Age,No of siblings/spouses aboard,No of parents/children aboard,Ticket number,Passenger fare,Port of Embarkation
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,S
...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,C

In [41]:
titanic_dataset["Age"].count()*100/titanic_dataset["Name"].count()

79.42583732057416

In [42]:
titanic_df2 = titanic_df1.drop("Port of Embarkation",axis=1,inplace=False)

In [43]:
titanic_df2

,Passenger ID,Passenger Ticket Class,Name,Gender,Age,No of siblings/spouses aboard,No of parents/children aboard,Ticket number,Passenger fare
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875
...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583

In [44]:
titanic_df3 = titanic_df2.drop(["Name","Ticket number","Passenger fare"],axis=1,inplace=False)

In [45]:
titanic_df3

,Passenger ID,Passenger Ticket Class,Gender,Age,No of siblings/spouses aboard,No of parents/children aboard
0,892,3,male,34.5,0,0
1,893,3,female,47.0,1,0
2,894,2,male,62.0,0,0
3,895,3,male,27.0,0,0
4,896,3,female,22.0,1,1
...,...,...,...,...,...,...
413,1305,3,male,NaN,0,0
414,1306,1,female,39.0,0,0
415,1307,3,male,38.5,0,0
416,1308,3,male,NaN,0,0
417,1309,3,male,NaN,1,1

In [46]:
med_age = titanic_df3["Age"].median()
med_age += 1
med_age

28.0

In [47]:
titanic_df4 = titanic_df3.copy()
titanic_df4["Age"] = titanic_df4["Age"].fillna(med_age)

In [48]:
titanic_df4

,Passenger ID,Passenger Ticket Class,Gender,Age,No of siblings/spouses aboard,No of parents/children aboard
0,892,3,male,34.5,0,0
1,893,3,female,47.0,1,0
2,894,2,male,62.0,0,0
3,895,3,male,27.0,0,0
4,896,3,female,22.0,1,1
...,...,...,...,...,...,...
413,1305,3,male,28.0,0,0
414,1306,1,female,39.0,0,0
415,1307,3,male,38.5,0,0
416,1308,3,male,28.0,0,0
417,1309,3,male,28.0,1,1

In [49]:
titanic_df5 = titanic_df4.copy()
titanic_df5["Gender"] = titanic_df5["Gender"].map({"male":1,"female":0})

In [50]:
titanic_df5

,Passenger ID,Passenger Ticket Class,Gender,Age,No of siblings/spouses aboard,No of parents/children aboard
0,892,3,1,34.5,0,0
1,893,3,0,47.0,1,0
2,894,2,1,62.0,0,0
3,895,3,1,27.0,0,0
4,896,3,0,22.0,1,1
...,...,...,...,...,...,...
413,1305,3,1,28.0,0,0
414,1306,1,0,39.0,0,0
415,1307,3,1,38.5,0,0
416,1308,3,1,28.0,0,0
417,1309,3,1,28.0,1,1

In [51]:
encod = OneHotEncoder(dtype=np.int64,drop=[3])
model = encod.fit((np.array(titanic_df5["Passenger Ticket Class"])).reshape(-1,1))

In [52]:
model

OneHotEncoder(drop=[3], dtype=<class 'numpy.int64'>)

In [53]:
one_hot_array = model.transform((np.array(titanic_df5["Passenger Ticket Class"])).reshape(-1,1)).toarray()
one_hot = pd.DataFrame(data=one_hot_array,columns=[1,2])
one_hot

     1  2
0    0  0
1    0  0
2    0  1
3    0  0
4    0  0
..  .. ..
413  0  0
414  1  0
415  0  0
416  0  0
417  0  0

[418 rows x 2 columns]

In [54]:
titanic_df6 = titanic_df5.drop("Passenger Ticket Class",axis=1,inplace=False)
titanic_df6.insert(1,"Ticket Class 1",one_hot[1])
titanic_df6.insert(2,"Ticket Class 2",one_hot[2])
titanic_df6

,Passenger ID,Ticket Class 1,Ticket Class 2,Gender,Age,No of siblings/spouses aboard,No of parents/children aboard
0,892,0,0,1,34.5,0,0
1,893,0,0,0,47.0,1,0
2,894,0,1,1,62.0,0,0
3,895,0,0,1,27.0,0,0
4,896,0,0,0,22.0,1,1
...,...,...,...,...,...,...,...
413,1305,0,0,1,28.0,0,0
414,1306,1,0,0,39.0,0,0
415,1307,0,0,1,38.5,0,0
416,1308,0,0,1,28.0,0,0
417,1309,0,0,1,28.0,1,1

In [55]:
titanic_df6["No of siblings/spouses aboard"].max()

8

In [56]:
titanic_df6.columns
titanic_df7 =titanic_df6.copy()

In [57]:
titanic_df7.to_csv("Dataset/preprocessed_test.csv")